macro_rules! symbols {
    ($(($v:literal, $c:literal, $s:expr)),* $(,)?) => {
        pub fn value_to_char(value: u32) -> Option<char> {
            Some(match value {
                $($v => $c,)*
                _ => { return None; }
            })
        }
        pub fn value_to_char_width(value: u32) -> Option<u32> {
            Some(match value {
                $($v => $s,)*
                _ => { return None; }
            })
        }
        pub fn char_to_value(char: char) -> Option<u32> {
            Some(match char {
                $($c => $v,)*
                _ => { return None; }
            })
        }
    };
}

symbols![
    (0, '1', 1),
    (1, '2', 1),
    (2, '3', 1),
    (3, '4', 1),
    (4, '5', 1),
    (5, '6', 1),
    (6, '7', 1),
    (7, '8', 1),
    (8, '9', 1),
    (9, '0', 1),
    (10, 'A', 1),
    (11, 'B', 1),
    (12, 'C', 1),
    (13, 'D', 1),
    (14, 'E', 1),
    (15, 'F', 1),
    (16, 'G', 1),
    (17, 'H', 1),
    (18, 'I', 1),
    (19, 'J', 1),
    (20, 'K', 1),
    (21, 'L', 1),
    (22, 'M', 1),
    (23, 'N', 1),
    (24, 'O', 1),
    (25, 'P', 1),
    (26, 'Q', 1),
    (27, 'R', 1),
    (28, 'S', 1),
    (29, 'T', 1),
    (30, 'U', 1),
    (31, 'V', 1),
    (32, 'W', 1),
    (33, 'X', 1),
    (34, 'Y', 1),
    (35, 'Z', 1),
    (36, 'Ψ', 1),
    (37, 'Ω', 1),
    (38, 'Φ', 1),
    (39, 'Δ', 1),
    (40, 'Ξ', 1),
    (41, 'Γ', 1),
    (42, 'Π', 1),
    (43, 'Σ', 1),
    (44, 'Д', 1),
    (45, 'Б', 1),
    (46, 'Џ', 1),
    (47, 'Ш', 1),
    (48, 'Ч', 1),
    (49, 'カ', 2),
    (50, 'サ', 2),
    (51, 'タ', 2),
    (52, 'ホ', 2),
    (53, 'ル', 2),
    (54, 'モ', 2),
    (55, 'テ', 2),
    (56, 'ツ', 2),
    (57, 'ウ', 2),
    (58, 'セ', 2),
    (59, 'オ', 2),
    (60, 'ア', 2),
    (61, 'ワ', 2),
    (62, 'ヌ', 2),
    (63, 'ス', 2),
];

#[test]
fn test_char_mapping() {
    for value in 0..64 {
        let char = value_to_char(value).unwrap();
        assert_eq!(char_to_value(char).unwrap(), value);
    }
}
